[{"Name":"Adaptability","ShortDescription":"Adaptability is an Ability that increases the power of moves with the same type as the user.","Description":"If the Pokémon uses a move with STAB, the damage is further increased by 2x."},{"Name":"Aerilate","ShortDescription":"Aerilate is an Ability that turns the user's Normal-type moves to Flying-type and boosts their power.","Description":"A Pokémon with Aerilate's Normal-type moves will become Flying-type and have their power increased by 1.2x."},{"Name":"Aftermath","ShortDescription":"Aftermath is an Ability that inflicts damage in a one-tile AoE when the Pokémon is defeated.","Description":"If the Pokémon is defeated, it will explode, damaging every Pokémon in a one tile AoE radius for 1/4 of their individual max HP. Aftermath will only damage other Pokémon if the map has no moral (black map name). It is negated if there's a Pokémon with Damp on the floor."},{"Name":"Air Lock","ShortDescription":"Air Lock is an Ability that removes weather on map entry.","Description":"If the map moral is None or No Death Penalty, or if the user is on an arena tile, and the user is not fainted, Air Lock sets the map's weather to clear when the user enters it. As long as the user is active on the map and the weather is clear, weather can't be changed."},{"Name":"Analytic","ShortDescription":"Analytic is an Ability that causes moves to become more powerful if used against the user's last attacker.","Description":"If the user uses a move on a Pokémon that was the last to hit the user, the damage is increased by 1.25x."},{"Name":"Anger Point","ShortDescription":"Anger Point is an Ability that increases Attack when the user gets hit by a move that results in a critical hit.","Description":"If the user gets hit by a move that causes a critical hit, its Attack is increased to the max."},{"Name":"Anticipation","ShortDescription":"Anticipation is an Ability that may let its user evade super-effective moves.","Description":"Accuracy of moves that are super-effective against the Pokémon is decreased by 0.8x."},{"Name":"Arena Trap","ShortDescription":"Arena Trap is an Ability that immobilizes opponents.","Description":"If the Pokémon hits a foe, it will be immobilized for two turns. If the Pokémon gets hit by a foe, it will be immobilized for one turn. Pokémon who are Flying-type, Ghost-type, are holding a  Shed Shell, have Levitate, Run Away, or status immunity are not affected."},{"Name":"Aroma Veil","ShortDescription":"Aroma Veil is an Ability that protects the user and its allies from attacks that limit move choices.","Description":"Protects the user and nearby allies from Taunt, Torment, Encore, Disable, Cursed Body, Heal Block, and infatuation status."},{"Name":"Aura Break","ShortDescription":"Aura Break is an Ability that inverses the effects of \"Aura\" Abilities.","Description":"Unknown."},{"Name":"Bad Dreams","ShortDescription":"Bad Dreams is an Ability that damages sleeping Pokémon.","Description":"If there's a sleeping Pokémon on the same map as the user, whenever the sleeping Pokémon acts, it will take damage equal to 1/16 of its max HP. If the Pokémon is holding a  Lunar Wing, Bad Dreams will not affect it."},{"Name":"Ball Fetch","ShortDescription":"Ball Fetch is an Ability.","Description":"Ball Fetch currently does not work."},{"Name":"Battery","ShortDescription":"Battery is an Ability that boosts the power of allies' special moves.","Description":"When within 10 tiles of any allies, the power of their special moves is boosted by 1.5x."},{"Name":"Battle Armor","ShortDescription":"Battle Armor is an Ability that protects the Pokémon from critical hits.","Description":"This Ability will prevent the user from being affected by any critical hits, regardless of if it was by chance or from moves and Abilities that would guarantee one."},{"Name":"Battle Bond","ShortDescription":"Hasn't been described in PMU game!","Description":"Unknown"},{"Name":"Beast Boost","ShortDescription":"Beast Boost is an Ability that may raise a Pokémon's highest stat.","Description":"A Pokémon with this Ability has a 1/3 chance of its highest stat (excluding HP) increasing by 1 stage when it defeats an enemy."},{"Name":"Berserk","ShortDescription":"Berserk is an Ability that affects the Special Attack stat.","Description":"If the Pokémon with this Ability takes damage from an attack equal to 50% or more of its max HP, its Special Attack stat is increased by 1 stage."},{"Name":"Big Pecks","ShortDescription":"Big Pecks is an Ability that prevents the user's Defense from being lowered.","Description":"The Pokémon can't have its Defense lowered by opponents' effects or its own actions."},{"Name":"Blaze","ShortDescription":"Blaze is an Ability that powers up Fire-type moves when HP is low.","Description":"When a Pokémon with this Ability has less than 25% of its max HP remaining, Fire-type moves will have their power increased by 1.5x."},{"Name":"Bulletproof","ShortDescription":"Bulletproof is an Ability that blocks certain attacks. Pokémon can also gain this Ability if it holds the  Sturdy Shield item.  ","Description":"Pokémon with this Ability will not be damaged by ball and bomb moves, including cannon-based and blast-based attacks."},{"Name":"Cheek Pouch","ShortDescription":"Cheek Pouch is an Ability that recovers HP when the Pokémon has eaten a Berry.","Description":"The Pokémon restores 1/4 of its HP when it consumes a Berry."},{"Name":"Chlorophyll","ShortDescription":"Chlorophyll is an Ability that boosts a Pokémon's attack speed in sunlight.","Description":"Moves used by the Pokémon have their cooldown reduced by 0.6x when under the effects of sunlight."},{"Name":"Clear Body","ShortDescription":"Clear Body is an Ability that prevents the user's stats from being lowered.","Description":"The Pokémon can't have its stats lowered by opponents' effects or its own actions."},{"Name":"Cloud Nine","ShortDescription":"Cloud Nine is an Ability that removes weather on map entry.","Description":"If the map moral is None or No Death Penalty, or if the user is on an arena tile, and the user is not fainted, Cloud Nine sets the map's weather to clear when the user enters it. As long as the user is active on the map and the weather is clear, weather can't be changed."},{"Name":"Color Change","ShortDescription":"Color Change is an Ability that causes the Pokémon to change its type when hit by certain moves. ","Description":"Whenever the Pokémon gets hit by a non-status, non-typeless move, it becomes purely that move's type, provided the user isn't already purely that type or typeless."},{"Name":"Comatose","ShortDescription":"Comatose is an Ability that treats the user as if it is always asleep.","Description":"This Ability will treat the user as if it was afflicted with the sleep status condition, even if it doesn't have the condition. The Pokémon can use moves and those like Sleep Talk or Snore and cannot become drowsy from Yawn."},{"Name":"Competitive","ShortDescription":"Competitive is an Ability that raises Special Attack when a stat is lowered.","Description":"A Pokémon with Competitive will increase their Special Attack by 2 stages when a stat is lowered."},{"Name":"Compound Eyes","ShortDescription":"Compound Eyes is an Ability that boosts a Pokémon's accuracy.","Description":"Whenever the Pokémon uses a move, the move's accuracy is increased by 1.3x."},{"Name":"Contrary","ShortDescription":"Contrary is an Ability that reverses all of the Pokémon's stat changes.","Description":"Whenever the Pokémon's stats change, the changes are negated. Any positive stat changes become negative and vice versa."},{"Name":"Corrosion","ShortDescription":"Corrosion is an Ability that lets the user poison Pokémon regardless of type.","Description":"The user can poison Pokémon regardless of type, such as Steel and Poison-type Pokémon."},{"Name":"Cotton Down","ShortDescription":"Cotton Down is an Ability that affects the Speed stat.","Description":"When a Pokémon attacks the user of this Ability, the attacker has their Speed stat lowered by 1 stage."},{"Name":"Cursed Body","ShortDescription":"Cursed Body is an Ability that may seal moves that hit the Pokémon.","Description":"Whenever the Pokémon gets hit by a foe's move, it has a chance to seal the move."},{"Name":"Cute Charm","ShortDescription":"Cute Charm is an Ability that may cause attacking Pokémon to become infatuated.","Description":"If the user is attacked by a Pokémon of the opposite gender, or if both Pokémon are genderless, there's a 20% chance that the attacker gets infatuated for 3-4 turns if the attacker uses a move that makes contact. Pokémon with Oblivious will not be affected."},{"Name":"Damp","ShortDescription":"Damp is an Ability which prevents the detonations of explosives.","Description":"If a Pokémon with Damp is on the map or floor, the moves Self-Destruct, Explosion and the namesake traps will not work. In addition, Pokémon with the Ability Aftermath will also not explode upon fainting."},{"Name":"Dancer","ShortDescription":"Dancer is an Ability.","Description":"Dancer currently does not work."},{"Name":"Dark Aura","ShortDescription":"Dark Aura is an Ability that boosts the power of Dark-type moves.","Description":"Pokémon with Dark Aura will increase the power of Dark-type moves for its team, but not for itself."},{"Name":"Dauntless Shield","ShortDescription":"Hasn't been described in PMU game!","Description":"Unknown"},{"Name":"Dazzling","ShortDescription":"Dazzling is an Ability that prevents opponents from using ranged moves on the user.","Description":"The Pokémon can't be hit by moves from 4 or more tiles away, unless it is a line of sight move."},{"Name":"Defeatist","ShortDescription":"Defeatist is an Ability that halves a Pokémon's attacking stats.","Description":"When a Pokémon with this Ability 50% or less of its max HP remaining, their Attack and Special Attack will be decreased by 0.5x."},{"Name":"Defiant","ShortDescription":"Defiant is an Ability that raises the user's Attack when one of its stats are lowered.","Description":"If any of the user's stats are lowered, its Attack stat increases by 2 stages."},{"Name":"Delta Stream","ShortDescription":"Hasn't been described in PMU game!","Description":"Unknown"},{"Name":"Desolate Land","ShortDescription":"Hasn't been described in PMU game!","Description":"Unknown"},{"Name":"Disguise","ShortDescription":"Disguise is an Ability that negates damage from an attack.","Description":"Disguise currently does not work. "},{"Name":"Download","ShortDescription":"Download is an Ability that raises the Attack or Special Attack stat upon entering a new location.","Description":"Upon entering a map, the user's Attack or Special Attack will get increased by 1 stage based on the lowest total Defense or Special Defense of all non-allied entities on the map. Attack will get increased if Defense is lower, while Special Attack will get increased if the Special Defense is lower."},{"Name":"Drizzle","ShortDescription":"Drizzle is an Ability that changes weather.","Description":"When a Pokémon with Drizzle enters a floor or is already on the floor when it is entered, the weather on the floor becomes rain."},{"Name":"Drought","ShortDescription":"Drought is an Ability that changes weather.","Description":"When a Pokémon with Drought enters a floor or is already on the floor when it is entered, the weather on the floor becomes sunny."},{"Name":"Dry Skin","ShortDescription":"Dry Skin is an Ability that restores the user's HP if they're hit by Water-type moves or in rainy weather, or reduces HP if they're hit by Fire-type moves or in sunny weather.","Description":"If the user is hit by a Water-type move, a 1/4 of its max HP will be restored, along with the move having no effect on the user. In rain, the user regains 1/8 its max HP every 5 steps."},{"Name":"Early Bird","ShortDescription":"Early Bird is an Ability that reduces the number of turns a Pokémon is asleep for.","Description":"Pokémon with this Ability wake up from sleep in one turn."},{"Name":"Effect Spore","ShortDescription":"Effect Spore is an Ability that causes attacking enemy Pokémon to be inflicted with a status condition. A Pokémon can also gain this Ability when a  Spore Sac is kept in the bag.  ","Description":"If a Pokémon with Effect Spore is attacked with a move that makes contact, there is a 25% chance for the attacker to be inflicted with poison, paralysis, or sleep. This Ability only works in dungeons."},{"Name":"Electric Surge","ShortDescription":"Electric Surge is an Ability that affects the terrain. ","Description":"Upon entering a floor, the effect of the move Electric Terrain is created."},{"Name":"Emergency Exit","ShortDescription":"Emergency Exit is an Ability that throws the user backwards when their HP drops below half.","Description":"When the user's HP goes below half, they will suddenly be thrown backwards and stop only upon reaching the block behind them. This Ability won't activate if the user's HP falls below half due to harmful weather, hurting itself in confusion, or by using a move like Substitute or Belly Drum."},{"Name":"Fairy Aura","ShortDescription":"Fairy Aura is an Ability that boosts the power of Fairy-type moves.","Description":"Pokémon with Dark Aura will increase the power of Fairy-type moves for its team, but not for itself."},{"Name":"Filter","ShortDescription":"Filter is an Ability that reduces damage taken from super-effective attacks.","Description":"Pokémon with this Ability take 0.75x less damage from super-effective attacks, regardless of the effectiveness multiplier."},{"Name":"Flame Body","ShortDescription":"Flame Body is an Ability that may burn attacking Pokémon.","Description":"If a Pokémon with Flame Body is hit by a move that makes contact, the attacker has a 1/3 chance to become burned."},{"Name":"Flare Boost","ShortDescription":"Flare Boost is an Ability that boosts the damage of Special moves when the user is burned. A Pokémon can also gain this Ability if it holds the  Scorched Bandana item.","Description":"If the user has a burn, the damage of its special moves is increased by 1.5x."},{"Name":"Flash Fire","ShortDescription":"Flash Fire is an Ability that gives a power boost to Fire-type moves when a Pokémon with the Ability is hit by a Fire-type move.","Description":"If a Pokémon with Flash Fire is hit by a Fire-type move, the Pokémon's Fire-type moves will deal 1.5x more damage. The Ability will not stack and is reset after every floor. Pokémon with the Ability are completely immune to Fire-type attacks."},{"Name":"Flower Gift","ShortDescription":"Flower Gift is an Ability that raises the Attack and Special Defense of the user and its allies when its sunny, along with changing Cherrim from Overcast Form to Sunshine Form.","Description":"In sunny weather, the Attack and Special Defense of the user and allies that are within 10 tiles is increased by 1.5x. It also changes Cherrim from Overcast Form to Sunshine Form. The Pokémon must be active (but does not need to enter the floor) for the stat boost to take effect. The effect will stack if there are multiple Pokémon with Flower Gift."},{"Name":"Flower Veil","ShortDescription":"Flower Veil is an Ability that protects Grass-type allies from status conditions and lowered stats.","Description":"When the user is nearby, Grass-type allies are protected from non-volatile status conditions, Yawn, and having their stats lowered. The user will also be protected if it is Grass-type. This Ability won't activate with Rest, a  Toxic Orb or a  Flame Orb."},{"Name":"Fluffy","ShortDescription":"Fluffy is an Ability that halves damage from contact moves and doubles damage from Fire-type moves.","Description":"Pokémon with this Ability take 0.5x damage from contact moves and 2x damage from Fire-type moves. Fire-type moves that make contact do regular damage."},{"Name":"Forecast","ShortDescription":"Forecast is an Ability exclusive to Castform that allows it to change forms to match the current weather.","Description":"Castform changes its form automatically depending on the current weather condition."},{"Name":"Forewarn","ShortDescription":"Forewarn is an Ability that reduces accuracy of moves.","Description":"Moves at 80 power or more used against the Pokémon have their accuracy decreased by 0.8x."},{"Name":"Friend Guard","ShortDescription":"Friend Guard is an Ability that reduces damage done to allies.","Description":"When a Pokémon with Friend Guard is within 10 tiles of any allies, damage taken by the allies is reduced by 0.8x. This can stack with other Pokémon nearby that also have Friend Guard. It does not reduce damage dealt by moves that deal direct damage."},{"Name":"Frisk","ShortDescription":"Frisk is an Ability that reveals hidden items on dungeon floors. Pokémon can also gain this Ability if it or a team member holds the  Treasure Specs item.  ","Description":"When entering a new floor as the Pokémon, all hidden items will become visible."},{"Name":"Full Metal Body","ShortDescription":"Full Metal Body that prevents the user's stats from being lowered by other Pokémon.","Description":"The Pokémon can't have its stats be lowered by opponents' effects, such as by Abilities or moves. However, the user can still lower their own stats."},{"Name":"Fur Coat","ShortDescription":"Fur Coat is an Ability that doubles the Defense stat of the user.","Description":"Pokémon with this Ability have their Defense stat increased by 2x."},{"Name":"Gale Wings","ShortDescription":"Gale Wings is an Ability that increases the range of Flying-type moves.","Description":"When the Pokémon with this Ability uses any Flying-type move, its range will be extended by 2 tiles."},{"Name":"Galvanize","ShortDescription":"Galvanize is an Ability that turns the user's Normal-type moves to Electric-type and raises their power.","Description":"A Pokémon with Galvanize's Normal-type moves will become Electric-type and have their power increased by 1.2x."},{"Name":"Gluttony","ShortDescription":"Gluttony is an Ability that restores 60 HP upon eating a natural food item.","Description":"If a Pokémon with Gluttony eats a fruit or a Berry, they receive 60 HP as well as any benefits provided by the fruit or Berry. It will stack with the healing effect of the edible item if it has one."},{"Name":"Gooey","ShortDescription":"Gooey is an Ability that affects movement.","Description":"If the Pokémon with this Ability is hit by any move that makes contact, the attacker's movement speed is decreased by 1 stage for 10-14 steps."},{"Name":"Gorilla Tactics","ShortDescription":"Hasn't been described in PMU game!","Description":"Unknown"},{"Name":"Grass Pelt","ShortDescription":"Grass Pelt is an Ability that raises the user's Defense in Grassy Terrain.","Description":"If the user is under the effects of Grassy Terrain, its Defense is increased by 2x."},{"Name":"Grassy Surge","ShortDescription":"Grassy Surge is an Ability that affects the terrain.","Description":"Upon entering a floor, the effect of the move Grassy Terrain is created."},{"Name":"Gulp Missile","ShortDescription":"Hasn't been described in PMU game!","Description":"Unknown"},{"Name":"Guts","ShortDescription":"Guts is an Ability that boosts the Attack stat of a Pokémon when they are inflicted with a status condition.","Description":"The Pokémon's Attack stat is increased by 1.5x it is inflicted with a non-volatile status condition. "},{"Name":"Harvest","ShortDescription":"Harvest is an Ability that doubles the effect of berries when they are eaten.","Description":"When a Pokémon with Harvest eats a Berry, the effect of eating the Berry is doubled. This includes the Berry's original effect as well as the effect on the Belly."},{"Name":"Healer","ShortDescription":"Healer is an Ability that heals major status conditions of nearby allies.","Description":"Pokémon with Healer will heal non-volatile status conditions of allies within 10 tiles when they take a turn."},{"Name":"Heatproof","ShortDescription":"Heatproof is an Ability that halves damage from Fire-type moves and negates damage from burns.","Description":"Pokémon with Heatproof take 0.5x damage from Fire-type moves. No damage from burns is received."},{"Name":"Heavy Metal","ShortDescription":"Heavy Metal is an Ability that doubles the user's weight.","Description":"The user's weight is increased by 2x. This raises damage taken from Low Kick and Grass Knot, lowers damage taken from Heavy Slam and Heat Crash, along with raising damage the user does with Heavy Slam and Heat Crash."},{"Name":"Honey Gather","ShortDescription":"Honey Gather is an Ability that may give its user  Honey. ","Description":"Honey Gather may get its user a Honey on random dungeon floor entry. Its effect is varied between player recruits and NPC Pokémon, but the shared algorithm is listed below."},{"Name":"Huge Power","ShortDescription":"Huge Power is an Ability that doubles the Attack stat of the user.","Description":"Pokémon with this Ability have their Attack stat increased by 2x."},{"Name":"Hunger Switch","ShortDescription":"Hunger Switch is an Ability that switches Morpeko's form. ","Description":"When the Pokémon with this Ability takes a turn against something, their form will switch to Full Belly Mode or Hangry Mode. The move Aura Wheel changes from Electric-type to Dark-type when in Hangry Mode."},{"Name":"Hustle","ShortDescription":"Hustle is an Ability that boosts the damage of physical attacks, but lowers their accuracy.","Description":"Physical moves deal 1.5x more damage with this Ability, but maximum accuracy is reduced to 80%."},{"Name":"Hydration","ShortDescription":"Hydration is an Ability that heals major status conditions in rainy weather.","Description":"A Pokémon with Hydration will have any non-volatile status condition healed through usage of items or attacks if it is raining."},{"Name":"Hyper Cutter","ShortDescription":"Hyper Cutter is an Ability that prevents other Pokémon from lowering the user's Attack stat.","Description":"The user's Attack stat can't be lowered by opponents. It can still lower its own Attack, such as by using stat-lowering moves."},{"Name":"Ice Body","ShortDescription":"Ice Body is an Ability that makes HP regenerate faster when the weather is hail.","Description":"Pokémon with this Ability restore HP  at a quicker rate when moving if in hail."},{"Name":"Ice Face","ShortDescription":"Hasn't been described in PMU game!","Description":"Unknown"},{"Name":"Ice Scales","ShortDescription":"Hasn't been described in PMU game!","Description":"Unknown"},{"Name":"Illuminate","ShortDescription":"Illuminate is an Ability that increases the spawn rate of Pokémon.","Description":"When the Pokémon with this Ability enters a floor, the spawn rate of Pokémon is increased slightly."},{"Name":"Illusion","ShortDescription":"Illusion is an Ability that disguises the user.","Description":"When a Pokémon with Illusion changes maps, it will disguise itself as whichever Pokémon is in the slot behind it (if in the second slot, it will disguise as the third. If fourth slot, it will disguise as the party leader). The Illusion will be broken once the user takes damage. It is not possible for the illusion to show as a shiny Pokémon. Illusion will currently only work in maps with the \"House\" Moral."},{"Name":"Immunity","ShortDescription":"Immunity is an Ability that prevents the user from being poisoned.","Description":"The user cannot be poisoned."},{"Name":"Imposter","ShortDescription":"Imposter an Ability.","Description":"Imposter currently does not work."},{"Name":"Infiltrator","ShortDescription":"Infiltrator is an Ability that ignores some defensive conditions when attacking an opponent.","Description":"A Pokémon with Infiltrator ignores an opponent's Magic Coat, Substitute, Safeguard, Light Screen, Reflect, or Aurora Veil."},{"Name":"Innards Out","ShortDescription":"Innards Out is an Ability that damages attacking Pokémon.","Description":"Innards Out currently does not work. "},{"Name":"Inner Focus","ShortDescription":"Inner Focus is an Ability that prevents cringing and Intimidate.","Description":"The user cannot cringe or and be affected by the Ability Intimidate."},{"Name":"Insomnia","ShortDescription":"Insomnia is an Ability that prevents the user from sleeping.","Description":"The user is prevented from falling asleep. This includes from the effects of moves and items, excluding the move Rest."},{"Name":"Intimidate","ShortDescription":"Intimidate is an Ability that lowers the Attack of opponents.","Description":"If the user attacks or is attacked, the opposing Pokémon will have its Attack stat lowered by 1 stage."},{"Name":"Intrepid Sword","ShortDescription":"Hasn't been described in PMU game!","Description":"Unknown"},{"Name":"Iron Barbs","ShortDescription":"Iron Barbs is an Ability that causes attackers to receive damage.","Description":"If a Pokémon with Iron Barbs is attacked with a move that makes contact and is within 1 tile, the attacker will lose 1/16 of its max HP."},{"Name":"Iron Fist","ShortDescription":"Iron Fist is an Ability that boosts the power of punching moves. A Pokémon can also gain this Ability if it or a team member holds the  Power Glove item.  ","Description":"Moves that involve punching will have their power increased by 1.2x when used by Pokémon with this Ability."},{"Name":"Justified","ShortDescription":"Justified is an Ability that raises the Attack stat when the user is hit by a Dark-type move.","Description":"If the user is hit by a Dark-type move, its Attack stat will increase by 1 stage."},{"Name":"Keen Eye","ShortDescription":"Keen Eye is an Ability that affects accuracy and vision in darkness.","Description":"Pokémon that have this Ability cannot have their accuracy lowered, and ignore evasion buffs on opponents. This Ability will also increase the radius of vision if there's darkness."},{"Name":"Klutz","ShortDescription":"Klutz is an Ability that affects held items.","Description":"If a Pokémon has this Ability, any item held by the Pokémon will not have its effects applied. This does not prevent experience-affecting items from working if they are held."},{"Name":"Leaf Guard","ShortDescription":"Leaf Guard is an Ability that prevents bad status conditions in sunny weather.","Description":"A Pokémon with Leaf Guard will have any bad status condition prevented if the weather is sunny. If a Pokémon with Leaf Guard receives a status condition when the weather is not sunny, the status condition will not be healed upon entering sunny weather."},{"Name":"Levitate","ShortDescription":"Levitate is an Ability that makes the user float, giving immunity to Ground-type moves, certain traps, and the ability to move over certain tiles.","Description":"The user avoids Ground-type moves, will not affected by Arena Trap, and takes no effect from the Spike and Toxic Spike Traps. It also gains mobility akin to a Flying-type."},{"Name":"Libero","ShortDescription":"Libero is an Ability that affects the moves of its user.","Description":"Moves used by the Pokémon will always get a STAB bonus. Moves will not affect or change the user's types."},{"Name":"Light Metal","ShortDescription":"Light Metal is an Ability that halves the user's weight.","Description":"The user's weight is decreased by 0.5x. This lowers damage taken from Low Kick and Grass Knot, raises damage taken from Heavy Slam and Heat Crash, along with lowering damage the user does with Heavy Slam and Heat Crash."},{"Name":"Lightning Rod","ShortDescription":"Lightning Rod is an Ability that affects Electric-type moves.","Description":"If an Electric-type move is used within 7 tiles of a Pokémon with this Ability, it will be redirected and hit only that Pokémon, and increase its Special Attack by 1 stage."},{"Name":"Limber","ShortDescription":"Limber is an Ability that prevents the Pokémon from being paralyzed.","Description":"The Pokémon cannot be inflicted with paralysis."},{"Name":"Liquid Ooze","ShortDescription":"Liquid Ooze is an Ability that affects HP-draining moves used on the Pokémon.","Description":"If the Pokémon is hit with an HP-draining attack, it will damage the attacker instead of healing them. The damage done will be the amount of HP that was supposed to be healed."},{"Name":"Liquid Voice","ShortDescription":"Liquid Voice is an Ability that changes the type of sound-based moves.","Description":"When a Pokémon with this Ability uses any sound-based moves, they will be treated as Water-type moves."},{"Name":"Long Reach","ShortDescription":"Long Reach is an Ability that lets the user use moves without making contact.","Description":"When the user uses a contact move, it won't activate any effects caused by contact."},{"Name":"Magic Bounce","ShortDescription":"Magic Bounce is an Ability that reflects status moves.","Description":"The user reflects status moves back to the opponent that used them. This includes stat-lowering moves (except Memento), status condition-inducing moves, traps, and all the moves that Magic Coat can reflect."},{"Name":"Magic Guard","ShortDescription":"Magic Guard is an Ability that makes the user only take damage from attacks.","Description":"The user is immune to indirect damage, such as from weather, damaging status conditions, damaging traps, recoil (except Struggle), and items like  Life Orb. It does not prevent a status condition from being afflicted. It also doesn't prevent effects that do direct damage, such as from confusion, Substitute, or Perish Song."},{"Name":"Magician","ShortDescription":"Magician is an Ability that steals items from enemies.","Description":"When a Pokémon with this Ability hits an enemy that is holding an item with a damaging move, the held item will be put into the bag."},{"Name":"Magma Armor","ShortDescription":"Magma Armor is an Ability that prevents being frozen.","Description":"This Ability prevents the user from being frozen."},{"Name":"Magnet Pull","ShortDescription":"Magnet Pull is an Ability that prevents Steel-type Pokémon from moving.","Description":"If a Steel-type Pokémon attacks the user, it will become immobilized. Ghost-type Pokémon are immune to this Ability, even if they're also Steel-type."},{"Name":"Marvel Scale","ShortDescription":"Marvel Scale is an Ability that boosts the user's Defense if it has a status condition. A Pokémon can also gain this Ability if it holds the  Mermaid Veil item.","Description":"If the user has a non-volatile status condition, its Defense is increased by 1.5x."},{"Name":"Mega Launcher","ShortDescription":"Mega Launcher is an Ability that boosts the power of \"aura\" and \"pulse\" moves.","Description":"The user's damaging aura and pulse moves have their power increased by 1.5x, and Heal Pulse now heals 75% of the target's max HP instead of 50%."},{"Name":"Merciless","ShortDescription":"Merciless is an Ability that ensures critical hits on poisoned opponents.","Description":"If a Pokémon is poisoned, any attack used on it by the Ability's user will always result in a critical hit. This will not occur if the target has Battle Armor, Shell Armor, or is under the effects of Lucky Chant."},{"Name":"Mimicry","ShortDescription":"Hasn't been described in PMU game!","Description":"Unknown"},{"Name":"Minus","ShortDescription":"Minus is an Ability that boosts Attack and Special Attack when with an ally that also has Plus.","Description":"When within 10 tiles of an ally that has Plus, the user's Attack and Special Attack is increased by 1.5x."},{"Name":"Mirror Armor","ShortDescription":"Mirror Armor is an Ability that reflects certain stat changes.","Description":"When a Pokémon with this Ability is targeted by a move or Ability that lowers stats, the stat-lowering effects get reflected back at the user."},{"Name":"Misty Surge","ShortDescription":"Misty Surge is an Ability that affects the terrain.","Description":"Upon entering a floor, the effect of the move Misty Terrain is created."},{"Name":"Mold Breaker","ShortDescription":"Mold Breaker is an Ability that bypasses certain Abilities of Pokémon that may affect the user's damage or effects.","Description":"If the user uses a move on a Pokémon and there is an Ability in play that may negatively affect the move's damage or effects, Mold Breaker completely bypasses it."},{"Name":"Moody","ShortDescription":"Moody is an Ability that raises one of the user's stats and lowers another.","Description":"When attacked, there is a chance that the Pokémon will have one stat increase by 1 stage and another lowered by 2 stages."},{"Name":"Motor Drive","ShortDescription":"Motor Drive is an Ability that raises the user's Speed when hit by an Electric-type move.","Description":"The user's Speed stat is increased by 1 stage when hit by an Electric-type move."},{"Name":"Moxie","ShortDescription":"Moxie is an Ability that may raise the Attack stat of the user.","Description":"A Pokémon with this Ability has a 1/3 chance of its Attack stat increasing by 1 stage when it defeats an enemy."},{"Name":"Multiscale","ShortDescription":"Multiscale is an Ability that reduces damage taken when HP is full.","Description":"When the user's HP is full, the damage taken from attacks is halved. This Ability doesn't affect directly damaging moves."},{"Name":"Multitype","ShortDescription":"Hasn't been described in PMU game!","Description":"Unknown"},{"Name":"Mummy","ShortDescription":"Mummy is an Ability that affects the opposing enemy's Ability.","Description":"When hit with a move that makes contact, the attacker has a chance to gain the Mummy Ability. Besides spreading, the Ability itself does nothing."},{"Name":"Natural Cure","ShortDescription":"Natural Cure is an Ability that allows a Pokémon to cure itself of any major status condition when changing maps.","Description":"If the Pokémon has a non-volatile status condition, it is cured when it enters a new dungeon floor or map and does not have to be active to do so."},{"Name":"Neuroforce","ShortDescription":"Neuroforce is the signature Ability of Ultra Necrozma.","Description":"When a move is super-effective against another Pokémon, the move's power is increased by 1.25x."},{"Name":"Neutralizing Gas","ShortDescription":"Hasn't been described in PMU game!","Description":"Unknown"},{"Name":"No Guard","ShortDescription":"No Guard is an Ability that makes moves always hit.","Description":"Moves used by or against the user are granted 100% accuracy. It does not allow Pokémon to be hit during semi-invulnerable moves, like Fly."},{"Name":"Normalize","ShortDescription":"Normalize is an Ability that turns all the user's moves to Normal-type and boosts their power.","Description":"A Pokémon with Normalize's moves will become Normal-type and have their power increased by 1.2x. This allows moves to do normal damage on Pokémon types it usually can't affect, like Thunderbolt against a Ground-type. This also means that any move the user has can't affect Ghost-types."},{"Name":"Oblivious","ShortDescription":"Oblivious is an Ability that protects the user from infatuation and being taunted. A Pokémon can also gain this Ability if it holds the  Failed Experiment item.","Description":"Pokémon with Oblivious cannot be infatuated and are immune to the moves Captivate and Taunt."},{"Name":"Overcoat","ShortDescription":"Overcoat is an Ability that protects the user from harmful weather, powder, and spores.","Description":"The user is immune to damaging weather, such as sandstorm and hail, along with powder moves, spore moves, and Effect Spore."},{"Name":"Overgrow","ShortDescription":"Overgrow is an Ability that powers up Grass-type moves while in a pinch.","Description":"When a Pokémon with this Ability has less than 25% of its max HP remaining, Grass-type moves will have their power increased by 1.5x."},{"Name":"Own Tempo","ShortDescription":"Own Tempo is an Ability that prevents the Pokémon from being confused and affected by the Ability Intimidate.","Description":"The Pokémon cannot be inflicted with confusion or affected by Intimidate."},{"Name":"Parental Bond","ShortDescription":"Hasn't been described in PMU game!","Description":"Unknown"},{"Name":"Pastel Veil","ShortDescription":"Hasn't been described in PMU game!","Description":"Unknown"},{"Name":"Perish Body","ShortDescription":"Hasn't been described in PMU game!","Description":"Unknown"},{"Name":"Pickpocket","ShortDescription":"Pickpocket is an Ability that steals items from enemies.","Description":"When a Pokémon with this Ability gets hits by an enemy that is holding an item with a damaging move that makes contact, the held item will be put into the bag."},{"Name":"Pickup","ShortDescription":"Pickup is an Ability that may grant its user an item. A Pokémon can also gain this Ability if holds the Scavenger Charm item.","Description":"Pickup may get its user an item on random dungeon floor entry. Its effect is varied between player recruits and NPC Pokémon, but the shared algorithm is listed below."},{"Name":"Pixilate","ShortDescription":"Pixilate is an Ability that turns the user's Normal-type moves to Fairy-type and boosts their power.","Description":"A Pokémon with Pixilate's Normal-type moves will become Fairy-type and have their power increased by 1.2x."},{"Name":"Plus","ShortDescription":"Plus is an Ability that boosts Attack and Special Attack when with an ally that also has Minus.","Description":"When within 10 tiles of an ally that has Minus, the user's Attack and Special Attack is increased by 1.5x."},{"Name":"Poison Heal","ShortDescription":"Poison Heal is an Ability that makes HP regenerate faster when poisoned","Description":"Pokémon with this Ability restore HP  at a quicker rate when moving if poisoned."},{"Name":"Poison Point","ShortDescription":"Poison Point is an Ability that can poison attackers on contact.","Description":"If a Pokémon with Poison Point is hit by a move that makes contact, the attacker has a 1/3 chance to become poisoned."},{"Name":"Poison Touch","ShortDescription":"Poison Touch is an Ability that can poison opponents on contact.","Description":"Poison Touch currently does not work. "},{"Name":"Power Construct","ShortDescription":"Power Construct is one of Zygarde's signature Abilities.","Description":"If Zygarde in its 10% or 50% form is below half of its HP, it changes into its Complete form."},{"Name":"Power of Alchemy","ShortDescription":"Power of Alchemy is an Ability that copies the Ability of another Pokémon.","Description":"When an ally of the user is defeated, this Ability will replace the user's Abilities with those of the defeated ally."},{"Name":"Power Spot","ShortDescription":"Hasn't been described in PMU game!","Description":"Unknown"},{"Name":"Prankster","ShortDescription":"Prankster is an Ability that affects status moves.","Description":"Pokémon with this Ability have the range of their status moves increased by 2 tiles."},{"Name":"Pressure","ShortDescription":"Pressure is an Ability that increases PP usage of opponents.","Description":"If the user is targeted by a move, the opponent consumes twice the amount of PP, even if the move misses."},{"Name":"Primordial Sea","ShortDescription":"Hasn't been described in PMU game!","Description":"Unknown"},{"Name":"Prism Armor","ShortDescription":"Hasn't been described in PMU game!","Description":"Unknown"},{"Name":"Propeller Tail","ShortDescription":"Propeller Tail is an Ability that negates redirection.","Description":"The user ignores moves such as Rage Powder or Follow Me, or Abilities such as Storm Drain. However, Abilities that gives type immunity like Sap Sipper or Dry Skin will not be ignored."},{"Name":"Protean","ShortDescription":"Protean is an Ability that affects the moves of its user.","Description":"Moves used by the Pokémon will always get a STAB bonus. Moves will not affect or change the user's types."},{"Name":"Psychic Surge","ShortDescription":"Psychic Surge is an Ability that affects the terrain.","Description":"Upon entering a floor, the effect of the move Psychic Terrain is created."},{"Name":"Punk Rock","ShortDescription":"Hasn't been described in PMU game!","Description":"Unknown"},{"Name":"Pure Power","ShortDescription":"Pure Power is an Ability that doubles the Attack stat of the user.","Description":"Pokémon with this Ability have their Attack stat increased by 2x."},{"Name":"Queenly Majesty","ShortDescription":"Queenly Majesty is an Ability that prevents opponents from using ranged moves on the user.","Description":"The Pokémon can't be hit by moves from 4 or more tiles away, unless it is a line of sight move."},{"Name":"Quick Feet","ShortDescription":"Quick Feet is an Ability that boosts the movement speed of a Pokémon with a non-volatile status condition. ","Description":"If the Pokémon has a non-volatile status condition, their movement speed will be boosted by 1 stage"},{"Name":"Rain Dish","ShortDescription":"Rain Dish is an Ability that makes HP regenerate faster when the weather is rain.","Description":"Pokémon with this Ability restore HP at a quicker rate when moving if in rain."},{"Name":"Rattled","ShortDescription":"Rattled is an Ability that raises the user's Speed when attacked by Dark-, Ghost-, and Bug-type moves.","Description":"The user's Speed stat will increase by 1 stage when attacked with a Dark-, Ghost-, or Bug-type move."},{"Name":"Receiver","ShortDescription":"Receiver is an Ability.","Description":"Receiver currently does not work."},{"Name":"Reckless","ShortDescription":"Reckless is an Ability that boosts the power of moves that cause crashes and recoil.","Description":"Pokémon with this Ability have the damage of their recoil and crash moves increased by 1.2x."},{"Name":"Refrigerate","ShortDescription":"Refrigerate is an Ability that turns the user's Normal-type moves to Ice-type and boosts their power.","Description":"A Pokémon with Refrigerate's Normal-type moves will become Ice-type and have their power increased by 1.2x."},{"Name":"Regenerator","ShortDescription":"Regenerator is an Ability that heals its user.","Description":"Every time the user enters another floor in a dungeon or goes through a map transition, they will restore 1/3 of their max HP. This will take effect even if that Pokémon is not active during the transition."},{"Name":"Ripen","ShortDescription":"Ripen is an Ability that doubles the effect of berries when they are eaten.","Description":"When a Pokémon with Ripen eats a Berry, the effect of eating the Berry is doubled. This includes the Berry's original effect as well as the effect on the Belly."},{"Name":"Rivalry","ShortDescription":"Rivalry is an Ability that boosts or reduces move power depending on the target Pokémon's gender.","Description":"If a Pokémon has this Ability, it increases its move power by 1.25x if the target is the same gender, or increases by 0.75x if the target is the opposite gender. If the user or target is genderless, then move power is unaffected."},{"Name":"RKS System","ShortDescription":"Hasn't been described in PMU game!","Description":"Unknown"},{"Name":"Rock Head","ShortDescription":"Rock Head is an Ability that negates recoil damage.","Description":"Pokémon with this Ability are protected from recoil damage."},{"Name":"Rough Skin","ShortDescription":"Rough Skin is an Ability that causes attackers to receive damage.","Description":"If a Pokémon with Iron Barbs is attacked with a move that makes contact and is within 1 tile, the attacker will lose 1/36 of its max HP."},{"Name":"Run Away","ShortDescription":"Run Away is an Ability that prevents immobilization.","Description":"The user cannot be immobilized, such as from moves or Abilities."},{"Name":"Sand Force","ShortDescription":"Sand Force is an Ability that boosts the power of the Rock-, Ground-, and Steel-type moves in a sandstorm.","Description":"The power of the user's Rock-, Ground-, and Steel-type moves is increased by 1.3x in a sandstorm. The Pokémon will not take damage from a sandstorm if it would normally."},{"Name":"Sand Rush","ShortDescription":"Sand Rush is an Ability that boosts a Pokémon's attack speed in a sandstorm.","Description":"Moves used by the Pokémon have their cooldown reduced by 0.6x when under the effects of a sandstorm. The Pokémon will not take damage from sandstorms if it would normally."},{"Name":"Sand Spit","ShortDescription":"Hasn't been described in PMU game!","Description":"Unknown"},{"Name":"Sand Stream","ShortDescription":"Sand Stream is an Ability that changes weather.","Description":"When a Pokémon with Sand Stream enters a floor or is already on the floor when it is entered, the weather on the floor becomes sandstorm."},{"Name":"Sand Veil","ShortDescription":"Sand Veil is an Ability that boosts the user's evasion in a sandstorm.","Description":"Accuracy of moves used against the Pokémon is decreased by 0.8x while under the effects of a sandstorm. The Pokémon will not take damage from sandstorms if it would normally."},{"Name":"Sap Sipper","ShortDescription":"Sap Sipper is an Ability that raises the user's Attack when hit by Grass-type moves.","Description":"When a Pokémon with this Ability is hit with a Grass-type move, the user will take no damage and their Attack stat will increase by 1 stage."},{"Name":"Schooling","ShortDescription":"Schooling is an Ability that is solely used by Wishiwashi.","Description":"If Wishiwashi is level 20 or higher with its HP above 25%, after being affected by a move, it will change into its School form. It will change back into its Solo form if it is affected by a move while at 25% HP or lower."},{"Name":"Scrappy","ShortDescription":"Scrappy is an Ability that lets the Pokémon attack Ghost-type Pokémon with Normal- and Fighting-type moves and blocks Intimidate.","Description":"The Pokémon does regular damage when attacking Ghost-types with Normal- and Fighting-type moves. It also blocks Intimidate."},{"Name":"Screen Cleaner","ShortDescription":"Hasn't been described in PMU game!","Description":"Unknown"},{"Name":"Serene Grace","ShortDescription":"Serene Grace is an Ability that boosts the user's chance of a move's additional effect happening.","Description":"The user's moves have the chance of their secondary effect (such as changing stats or inflicting status) happening doubled."},{"Name":"Shadow Shield","ShortDescription":"Hasn't been described in PMU game!","Description":"Unknown"},{"Name":"Shadow Tag","ShortDescription":"Shadow Tag is an Ability that immobilizes opponents.","Description":"If the Pokémon hits a foe, it will be immobilized for two turns. If the Pokémon gets hit by a foe, it will be immobilized for one turn. Pokémon who are Ghost-type, are holding a  Shed Shell, have Run Away, or status immunity are not affected."},{"Name":"Shed Skin","ShortDescription":"Shed Skin is an Ability that affects status conditions.","Description":"If the Pokémon holder is afflicted with a non-volatile status condition, it will have a chance of recovering automatically every move."},{"Name":"Sheer Force","ShortDescription":"Sheer Force is an Ability that boosts the power of moves, but removes their secondary effects.","Description":"The power of user's damaging moves that have secondary effect are increased by 1.3x, but their effects (such as changing stats or inflicting status) are removed."},{"Name":"Shell Armor","ShortDescription":"Shell Armor is an Ability that protects the Pokémon from critical hits.","Description":"This Ability will prevent the user from being affected by any critical hits, regardless of if it was by chance or from moves and Abilities that would guarantee one."},{"Name":"Shield Dust","ShortDescription":"Shield Dust is an Ability that prevents effects from opponents' attacks.","Description":"If the user is hit by a damaging move that has an effect, such as Body Slam paralyzing, the effect will be prevented."},{"Name":"Shields Down","ShortDescription":"Hasn't been described in PMU game!","Description":"Unknown"},{"Name":"Simple","ShortDescription":"Simple is an Ability that doubles the stat changes the user receives.","Description":"If the user is attacked by or uses a move that lowers or increases stats, the stat changes are doubled."},{"Name":"Skill Link","ShortDescription":"Skill Link is an Ability that boosts the power of certain multi-hit moves.","Description":"Multi-hit moves that normally hit 2-5 times in the main series have a 1.25x power increase when used by a Pokémon with this Ability."},{"Name":"Slow Start","ShortDescription":"Hasn't been described in PMU game!","Description":"Unknown"},{"Name":"Slush Rush","ShortDescription":"Slush Rush is an Ability that boosts a Pokémon's attack speed in hail.","Description":"Moves used by the Pokémon have their cooldown reduced by 0.6x when under the effects of hail."},{"Name":"Sniper","ShortDescription":"Sniper is an Ability that boosts the user's critical hit damage.","Description":"Critical hits' damage are further multiplied by 1.5x, for a total of 2.25x damage."},{"Name":"Snow Cloak","ShortDescription":"Snow Cloak is an Ability that boosts the user's evasion in hail.","Description":"Accuracy of moves used against the Pokémon is decreased by 0.8x while under the effects of hail. The Pokémon will not take damage from hail if it would normally."},{"Name":"Snow Warning","ShortDescription":"Snow Warning is an Ability that changes weather.","Description":"When a Pokémon with Snow Warning enters a floor or is already on the floor when it is entered, the weather on the floor becomes hail."},{"Name":"Solar Power","ShortDescription":"Solar Power is an Ability that boosts Special Attack and reduces HP in sunny weather.","Description":"In sunny weather, the user's Special Attack is increased by 1.5x, but it loses 1/8 of its max HP every 10 steps."},{"Name":"Solid Rock","ShortDescription":"Solid Rock is an Ability that reduces damage taken from super-effective attacks.","Description":"Pokémon with this Ability take 0.75x less damage from super-effective attacks, regardless of the effectiveness multiplier."},{"Name":"Soul-Heart","ShortDescription":"Soul-Heart is an Ability that may raise the user's Special Attack.","Description":"A Pokémon with this Ability has a 1/3 chance of its Special Attack stat increasing by 1 stage when it defeats an enemy."},{"Name":"Soundproof","ShortDescription":"Soundproof is an Ability that affects certain attacks.","Description":"This Ability grants the Pokémon immunity from moves that are sound-based."},{"Name":"Speed Boost","ShortDescription":"Speed Boost is an Ability that boosts movement speed while running.","Description":"A Pokémon with this Ability always has their movement speed boosted by 1 stage."},{"Name":"Stakeout","ShortDescription":"Stakeout is an Ability that increases damage dealt.","Description":"Damage inflicted is doubled on targets that are facing the same direction as the user."},{"Name":"Stall","ShortDescription":"Stall is an Ability that limits the range of all attacking moves to 2 tiles.","Description":"When using moves that deal direct damage, the range of the move is limited to 2 tiles."},{"Name":"Stalwart","ShortDescription":"Stalwart is an Ability that negates redirection.","Description":"The user ignores moves such as Rage Powder or Follow Me, or Abilities such as Storm Drain. However, Abilities that gives type immunity like Sap Sipper or Dry Skin will not be ignored."},{"Name":"Stamina","ShortDescription":"Stamina is an Ability that raises the Defense stat.","Description":"When a Pokémon with this Ability is hit with an attack, its Defense increases by 1 stage."},{"Name":"Stance Change","ShortDescription":"Stance Change is an Ability that changes Aegislash's form depending on the move it uses.","Description":"When the Pokémon Aegislash uses the move King's Shield, it changes from Blade forme to Shield forme. When it uses the basic attack, or any attack deals direct damage, Aegislash changes from Shield forme to Blade forme."},{"Name":"Static","ShortDescription":"Static is an Ability that paralyzes attacking Pokémon.","Description":"If a Pokémon with Static is hit by a move that makes contact, the attacker has a 1/3 chance to become paralyzed."},{"Name":"Steadfast","ShortDescription":"Steadfast is an Ability that raises the Speed stat.","Description":"Pokémon with this Ability will have their Speed stat increased by 1 stage every time they cringe."},{"Name":"Steam Engine","ShortDescription":"Steam Engine is an Ability that raises the Speed stat when hit by certain moves.","Description":"When a Pokémon with this Ability is hit by a Fire- or Water-type move, its Speed stat increases."},{"Name":"Steelworker","ShortDescription":"Steelworker is an Ability that boosts the power of Steel-type moves.","Description":"The user's Steel-type moves is increased by 1.5x."},{"Name":"Steely Spirit","ShortDescription":"Hasn't been described in PMU game!","Description":"Unknown"},{"Name":"Stench","ShortDescription":"Stench is an Ability that can make an enemy cringe, as well as make you immune to certain stealing item moves.","Description":"When the Pokémon with this Ability uses a damage-dealing contact move, there is a chance that the target will cringe. Pokémon with this Ability are also unaffected by Pluck and Bug Bite's item-stealing."},{"Name":"Sticky Hold","ShortDescription":"Sticky Hold is an Ability that prevents held items from being removed.","Description":"If the user is holding an item, it can't be taken, eaten, destroyed, or removed, such as by moves like Covet, Thief, Bug Bite, Pluck, Incinerate, Knock Off, Trick, or Switcheroo, Abilities like Magician and Pickpocket, or a Trip Trap."},{"Name":"Storm Drain","ShortDescription":"Storm Drain is an Ability that affects Water-type moves.","Description":"If a Water-type move is used within 7 tiles of a Pokémon with this Ability, it will be redirected and hit only that Pokémon, and increase its Special Attack by 1 stage."},{"Name":"Strong Jaw","ShortDescription":"Strong Jaw is an Ability that boosts the power of biting moves. A Pokémon can also gain this Ability if it or a team member holds the  Strong Teeth item.  ","Description":"Moves that involve biting will have their power increased by 1.5x when used by Pokémon with this Ability."},{"Name":"Sturdy","ShortDescription":"Sturdy is an Ability that lets a Pokémon survive a move that would have defeated it in one hit.","Description":"When hit by a move that would be able to one-hit-KO the Pokémon, it will not KO the Pokémon, but it will leave it at 1 HP. Mold Breaker and moves such as Destiny Bond will ignore this Ability."},{"Name":"Suction Cups","ShortDescription":"Suction Cups is an Ability that prevents forcing the user to move.","Description":"The user is prevented from being forcibly moved, such as by moves like Roar, items like a  Rollcall Orb, and traps like a Warp Trap."},{"Name":"Super Luck","ShortDescription":"Super Luck is an Ability that boosts critical hit chance.","Description":"The user's critical hit ratio is increased by 2x."},{"Name":"Surge Surfer","ShortDescription":"Surge Surfer is an Ability that boosts a Pokémon's attack speed in Electric Terrain.","Description":"Moves used by the Pokémon have their cooldown reduced by 0.6x when under the effects of Electric Terrain."},{"Name":"Swarm","ShortDescription":"Swarm is an Ability that powers up Bug-type moves while in a pinch.","Description":"When a Pokémon with this Ability has less than 25% of its max HP remaining, Bug-type moves will have their power increased by 1.5x."},{"Name":"Sweet Veil","ShortDescription":"Sweet Veil is an Ability that prevents the user and its allies from sleeping. ","Description":"The user and nearby allies are prevented from falling asleep. This includes from the effects of moves and items, excluding the move Rest."},{"Name":"Swift Swim","ShortDescription":"Swift Swim is an Ability that boosts a Pokémon's attack speed in rain.","Description":"Moves used by the Pokémon have their cooldown reduced by 0.6x when under the effects of rain."},{"Name":"Symbiosis","ShortDescription":"Symbiosis is an Ability.","Description":"Symbiosis currently does not work."},{"Name":"Synchronize","ShortDescription":"Synchronize is an Ability that inflicts status conditions.","Description":"Should the user be afflicted with a non-volatile status condition that is not sleep or freeze, the user will inflict the same status on the attacker if possible."},{"Name":"Tangled Feet","ShortDescription":"Tangled Feet is an Ability that boosts the user's evasion when confused.","Description":"Accuracy of moves used against the Pokémon is decreased by 0.5x while confused."},{"Name":"Tangling Hair","ShortDescription":"Tangling Hair is an Ability that affects movement.","Description":"If the Pokémon with this Ability is hit by any move that makes contact, the attacker's movement speed is decreased by 1 stage for 10-14 steps."},{"Name":"Technician","ShortDescription":"Technician is an Ability that boosts the power of moves with 60 or less base move power. A Pokémon can also gain this Ability if it or a team member holds the  Adept Belt item.","Description":"Moves with a base power of 60 or less will have their power increased by x1.5. Moves with variable power will only get the bonus boost if the resulting variable power is 60 or less."},{"Name":"Telepathy","ShortDescription":"Telepathy is an Ability that affects moves from allies.","Description":"Pokémon with this Ability will always avoid damaging moves used by allies. The Pokémon will not avoid moves that inflict status conditions."},{"Name":"Teravolt","ShortDescription":"Teravolt is an Ability that bypasses certain Abilities of Pokémon that may affect the user's damage or effects.","Description":"If the user uses a move on a Pokémon and there is an Ability in play that may negatively affect the move's damage or effects, Mold Breaker completely bypasses it."},{"Name":"Thick Fat","ShortDescription":"Thick Fat is an Ability that halves the damage taken from Fire- and Ice-type moves.","Description":"When the user is attacked by a Fire- or Ice-type move, the damage is reduced by 0.5x."},{"Name":"Tinted Lens","ShortDescription":"Tinted Lens is an Ability that boosts moves that aren't very effective.","Description":"If the user's move isn't very effective, its power is increased by 1.5x."},{"Name":"Torrent","ShortDescription":"Torrent is an Ability that powers up Water-type moves while in a pinch.","Description":"When a Pokémon with this Ability has less than 25% of its max HP remaining, Water-type moves will have their power increased by 1.5x."},{"Name":"Tough Claws","ShortDescription":"Tough Claws is an Ability that boosts the power of contact moves.","Description":"The power of the user's moves that make contact is increased by 1.3x."},{"Name":"Toxic Boost","ShortDescription":"Toxic Boost is an Ability that boosts the power of physical attacks when poisoned.","Description":"If the user is poisoned, the power of physical attacks is increased by 1.5x."},{"Name":"Trace","ShortDescription":"Trace is an Ability that copies Abilities of opponents.","Description":"A Pokémon with this Ability will copy an Ability of an opponent that uses a move on it and will last until it transitions to a new floor or area."},{"Name":"Triage","ShortDescription":"Triage is an Ability that increases the range of HP-restoring moves.","Description":"Moves that restore HP have their range increased by 2 tiles. This does not affect Grassy Terrain, Leech Seed, Pain Split, Present, or Pollen Puff. It also doesn't affect moves with self range, like Synthesis or Rest."},{"Name":"Truant","ShortDescription":"Truant is an Ability that decreases a Pokémon's attack speed. Pokémon with this Ability cannot be hit-stunned either.","Description":"Moves used by the Pokémon have their cooldown increased by 2x, but it also doesn't get affected by hit-stun."},{"Name":"Turboblaze","ShortDescription":"Turboblaze is an Ability that bypasses certain Abilities of Pokémon that may affect the user's damage or effects.","Description":"If the user uses a move on a Pokémon and there is an Ability in play that may negatively affect the move's damage or effects, Mold Breaker completely bypasses it."},{"Name":"Unaware","ShortDescription":"Unaware is an Ability that ignores opposing Pokémon's stat changes when the user attacks or is attacked.","Description":"When the user attacks, the opponent's Evasion, Defense, and Special Defense stat changes are ignored. When the user is attacked by an opponent, the opponent's Accuracy, Attack, and Special Attack stat changes are ignored."},{"Name":"Unburden","ShortDescription":"Unburden is an Ability that boosts a Pokémon's attack speed if it isn't holding an item.","Description":"Moves used by the Pokémon have their cooldown reduced by 0.75x if it isn't holding an item."},{"Name":"Unnerve","ShortDescription":"Unnerve is an Ability that makes opponents unable to eat.","Description":"If a Pokémon with Unnerve is within 5 tiles, opponents will not be able to use certain edible items, such as Berries and ethers."},{"Name":"Victory Star","ShortDescription":"Victory Star is an Ability that affects accuracy.","Description":"While a Pokémon with this Ability is active, moves used by it and its allies will gain 10% more accuracy."},{"Name":"Vital Spirit","ShortDescription":"Vital Spirit is an Ability that prevents the user from sleeping.","Description":"The user is prevented from falling asleep. This includes from the effects of moves and items, excluding the move Rest."},{"Name":"Volt Absorb","ShortDescription":"Volt Absorb is an Ability that restores the user's HP when hit by Electric-type moves.","Description":"If the user is hit by an Electric-type move, 1/4 of its max HP is restored instead of taking damage."},{"Name":"Wandering Spirit","ShortDescription":"Hasn't been described in PMU game!","Description":"Unknown"},{"Name":"Water Absorb","ShortDescription":"Water Absorb is an Ability that restores the user's HP when hit by Water-type moves.","Description":"If the user is hit by an Water-type move, 1/4 of its max HP is restored instead of taking damage."},{"Name":"Water Bubble","ShortDescription":"Water Bubble is an Ability that prevents burns, lowers damage from Fire-type moves, and boosts damage from Water-type moves.","Description":"Fire-type moves used against the Pokémon have their power decreased by 0.5x, and Water-type moves used by the Pokémon have their power increased by 2x. The user also cannot be burned."},{"Name":"Water Compaction","ShortDescription":"Water Compaction is an Ability that raises Defense when the user is hit with a Water-type move.","Description":"If the user gets hit by a Water-type move, their Defense will increase by 2 stages. The user still takes the damage however."},{"Name":"Water Veil","ShortDescription":"Water Veil is an Ability that prevents burns.","Description":"Pokémon with this Ability cannot be burned."},{"Name":"Weak Armor","ShortDescription":"Weak Armor is an Ability that raises Speed and lowers Defense when hit by physical moves.","Description":"When a Pokémon with this Ability is hit by a physical move, their Speed stat will increase by 2 stages and their Defense stat will lower by 1 stage."},{"Name":"White Smoke","ShortDescription":"White Smoke is an Ability that prevents the user's stats from being lowered.","Description":"The Pokémon can't have its stats lowered by opponents' effects or its own actions."},{"Name":"Wimp Out","ShortDescription":"Wimp Out is an Ability that throws the user backwards when their HP drops below half.","Description":"When the user's HP goes below half, they will suddenly be thrown backwards and stop only upon reaching the block behind them. This Ability won't activate if the user's HP falls below half due to harmful weather, hurting itself in confusion, or by using a move like Substitute or Belly Drum."},{"Name":"Wonder Guard","ShortDescription":"Wonder Guard is an Ability that makes the user immune to moves that aren't super-effective.","Description":"The user can only be damaged by super-effective moves and indirect damage, such as burns, weather, traps, and recoil."},{"Name":"Wonder Skin","ShortDescription":"Wonder Skin is an Ability that makes opponents' status moves more likely to miss.","Description":"Status moves used against the user have their accuracy changed to 50%. Other effects can still modify the accuracy after Wonder Skin's effect."},{"Name":"Zen Mode","ShortDescription":"Zen Mode is an Ability that changes the user's form at half HP.","Description":"Zen Mode currently does not work. "}]